# SQL GROUP Functions

Group functions are used to get aggregated summary information of a database with SQL queries. These functions generally perform operations such as collecting data in groups, counting, and averaging. The most commonly used group functions are:

- **COUNT:** Returns the number of rows found in the result of a query.
- **SUM:** Returns the sum of the numbers in a given column.
- **AVG:** Returns the average of the numbers in a given column.
- **MAX:** Returns the largest value in a given column.
- **MIN:** Returns the smallest value in a given column.

Group functions are often used with the "GROUP BY" statement. In this way, data is grouped according to a certain criterion or column and the values within the group are processed with these functions.

## For Example

In [ ]:
--
-- `customers`
--

CREATE TABLE `customers` (
  `customer_id` int(11) NOT NULL,
  `customer_name` varchar(50) DEFAULT NULL,
  `customer_email` varchar(100) DEFAULT NULL,
  `customer_age` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

INSERT INTO `customers` (`customer_id`, `customer_name`, `customer_email`, `customer_age`) VALUES
(1, 'Alice', 'alice@example.com', 28),
(2, 'Bob', 'bob@example.com', 32),
(3, 'Charlie', 'charlie@example.com', 24),
(4, 'David', 'david@example.com', 29),
(5, 'Emily', 'emily@example.com', 26),
(6, 'Frank', 'frank@example.com', 35),
(7, 'Grace', 'grace@example.com', 31),
(8, 'Helen', 'helen@example.com', 27),
(9, 'Ivan', 'ivan@example.com', 30),
(10, 'Jane', 'jane@example.com', 33),
(11, 'Kevin', 'kevin@example.com', 22),
(12, 'Laura', 'laura@example.com', 25),
(13, 'Mike', 'mike@example.com', 36),
(14, 'Nancy', 'nancy@example.com', 29),
(15, 'Oscar', 'oscar@example.com', 34),
(16, 'Pam', 'pam@example.com', 30),
(17, 'Quinn', 'quinn@example.com', 28),
(18, 'Roger', 'roger@example.com', 31),
(19, 'Sarah', 'sarah@example.com', 27),
(20, 'Tom', 'tom@example.com', 32);

--
-- `orders`
--

CREATE TABLE `orders` (
  `order_id` int(11) NOT NULL,
  `customer_id` int(11) DEFAULT NULL,
  `product_id` int(11) DEFAULT NULL,
  `order_date` date DEFAULT NULL,
  `total_amount` decimal(10,2) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;


INSERT INTO `orders` (`order_id`, `customer_id`, `product_id`, `order_date`, `total_amount`) VALUES
(1, 1, 1, '2023-01-15', '50.00'),
(2, 2, 10, '2023-02-10', '75.25'),
(3, 17, 2, '2023-03-05', '120.50'),
(4, 4, 3, '2023-04-20', '45.75'),
(5, 5, 2, '2023-05-12', '89.99'),
(6, 7, 9, '2023-06-30', '150.00'),
(7, 7, 6, '2023-07-22', '65.50'),
(8, 8, 7, '2023-08-18', '30.25'),
(9, 9, 9, '2023-09-01', '99.99'),
(10, 10, 1, '2023-10-11', '110.75'),
(11, 11, 3, '2023-11-25', '60.00'),
(12, 12, 8, '2023-12-12', '72.40'),
(13, 3, 10, '2024-01-08', '45.60'),
(14, 14, 9, '2024-02-19', '85.75'),
(15, 15, 5, '2024-03-03', '42.90'),
(16, 5, 4, '2024-04-14', '105.25'),
(17, 17, 3, '2024-05-29', '78.60'),
(18, 18, 2, '2024-06-10', '63.40'),
(19, 7, 4, '2024-07-17', '94.75'),
(20, 20, 1, '2024-08-22', '120.00');

--
-- `products`
--

CREATE TABLE `products` (
  `product_id` int(11) NOT NULL,
  `product_name` varchar(50) DEFAULT NULL,
  `unit_price` decimal(10,2) DEFAULT NULL,
  `stock_quantity` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

INSERT INTO `products` (`product_id`, `product_name`, `unit_price`, `stock_quantity`) VALUES
(1, 'Laptop', '999.99', 25),
(2, 'Smartphone', '499.99', 50),
(3, 'Tablet', '299.99', 30),
(4, 'Desktop PC', '799.99', 20),
(5, 'Monitor', '199.99', 40),
(6, 'Printer', '149.99', 15),
(7, 'Headphones', '69.99', 60),
(8, 'Keyboard', '29.99', 75),
(9, 'Mouse', '14.99', 100),
(10, 'External Hard Drive', '119.99', 35);

## - COUNT

Counting how many orders each customer has:

In [ ]:
SELECT c.customer_id, c.customer_name, COUNT(o.order_id) AS order_count
FROM customers c
LEFT JOIN orders o ON c.customer_id = o.customer_id
GROUP BY c.customer_id, c.customer_name;

In [ ]:
| customer_id| customer_name | order_count |
|------------|---------------|-------------|
| 1          | Alice         | 1           |
| 2          | Bob           | 1           |
| 3          | Charlie       | 1           |
| 4          | David         | 1           |
| 5          | Emily         | 2           |
| 6          | Frank         | 0           |
| 7          | Grace         | 3           |
| 8          | Helen         | 1           |
| 9          | Ivan          | 1           |
| 10         | Jane          | 1           |
| 11         | Kevin         | 1           |
| 12         | Laura         | 1           |
| 13         | Mike          | 0           |
| 14         | Nancy         | 1           |
| 15         | Oscar         | 1           |
| 16         | Pam           | 0           |
| 17         | Quinn         | 2           |
| 18         | Roger         | 1           |
| 19         | Sarah         | 0           |
| 20         | Tom           | 1           |

## - SUM

Totaling each customer's total order amount:

In [ ]:
SELECT c.customer_id, c.customer_name, SUM(o.total_amount) AS total_order_amount
FROM customers c
LEFT JOIN orders o ON c.customer_id = o.customer_id
GROUP BY c.customer_id, c.customer_name;

In [ ]:
| customer_id | customer_name | total_order_amount |
|-------------|---------------|--------------------|
| 1           | Alice         | 50.00              |
| 2           | Bob           | 75.25              |
| 3           | Charlie       | 45.60              |
| 4           | David         | 45.75              |
| 5           | Emily         | 195.24             |
| 6           | Frank         | NULL               |
| 7           | Grace         | 310.25             |
| 8           | Helen         | 30.25              |
| 9           | Ivan          | 99.99              |
| 10          | Jane          | 110.75             |
| 11          | Kevin         | 60.00              |
| 12          | Laura         | 72.40              |
| 13          | Mike          | NULL               |
| 14          | Nancy         | 85.75              |
| 15          | Oscar         | 42.90              |
| 16          | Pam           | NULL               |
| 17          | Quinn         | 199.10             |
| 18          | Roger         | 63.40              |
| 19          | Sarah         | NULL               |
| 20          | Tom           | 120.00             |

### - AVG

Calculating each customer's average order amount:

In [ ]:
SELECT c.customer_id, c.customer_name, AVG(o.total_amount) AS average_order_amount
FROM customers c
LEFT JOIN orders o ON c.customer_id = o.customer_id
GROUP BY c.customer_id, c.customer_name;

In [ ]:
| customer_id | customer_name | average_order_amount |
|-------------|---------------|-----------------------|
| 1           | Alice         | 50.000000            |
| 2           | Bob           | 75.250000            |
| 3           | Charlie       | 45.600000            |
| 4           | David         | 45.750000            |
| 5           | Emily         | 97.620000            |
| 6           | Frank         | NULL                 |
| 7           | Grace         | 103.416667           |
| 8           | Helen         | 30.250000            |
| 9           | Ivan          | 99.990000            |
| 10          | Jane          | 110.750000           |
| 11          | Kevin         | 60.000000            |
| 12          | Laura         | 72.400000            |
| 13          | Mike          | NULL                 |
| 14          | Nancy         | 85.750000            |
| 15          | Oscar         | 42.900000            |
| 16          | Pam           | NULL                 |
| 17          | Quinn         | 99.550000            |
| 18          | Roger         | 63.400000            |
| 19          | Sarah         | NULL                 |
| 20          | Tom           | 120.000000           |

### - MAX

Finding each customer's highest order amount:

In [ ]:
SELECT c.customer_id, c.customer_name, MAX(o.total_amount) AS max_order_amount
FROM customers c
LEFT JOIN orders o ON c.customer_id = o.customer_id
GROUP BY c.customer_id, c.customer_name;

In [ ]:
| customer_id | customer_name | max_order_amount |
|-------------|---------------|------------------|
| 1           | Alice         | 50.00            |
| 2           | Bob           | 75.25            |
| 3           | Charlie       | 45.60            |
| 4           | David         | 45.75            |
| 5           | Emily         | 105.25           |
| 6           | Frank         | NULL             |
| 7           | Grace         | 150.00           |
| 8           | Helen         | 30.25            |
| 9           | Ivan          | 99.99            |
| 10          | Jane          | 110.75           |
| 11          | Kevin         | 60.00            |
| 12          | Laura         | 72.40            |
| 13          | Mike          | NULL             |
| 14          | Nancy         | 85.75            |
| 15          | Oscar         | 42.90            |
| 16          | Pam           | NULL             |
| 17          | Quinn         | 120.50           |
| 18          | Roger         | 63.40            |
| 19          | Sarah         | NULL             |
| 20          | Tom           | 120.00           |

### - MIN

Finding each customer's minimum order amount:

In [ ]:
SELECT c.customer_id, c.customer_name, MIN(o.total_amount) AS min_order_amount
FROM customers c
LEFT JOIN orders o ON c.customer_id = o.customer_id
GROUP BY c.customer_id, c.customer_name;

In [ ]:
| customer_id | customer_name | min_order_amount |
|-------------|---------------|------------------|
| 1           | Alice         | 50.00            |
| 2           | Bob           | 75.25            |
| 3           | Charlie       | 45.60            |
| 4           | David         | 45.75            |
| 5           | Emily         | 89.99            |
| 6           | Frank         | NULL             |
| 7           | Grace         | 65.50            |
| 8           | Helen         | 30.25            |
| 9           | Ivan          | 99.99            |
| 10          | Jane          | 110.75           |
| 11          | Kevin         | 60.00            |
| 12          | Laura         | 72.40            |
| 13          | Mike          | NULL             |
| 14          | Nancy         | 85.75            |
| 15          | Oscar         | 42.90            |
| 16          | Pam           | NULL             |
| 17          | Quinn         | 78.60            |
| 18          | Roger         | 63.40            |
| 19          | Sarah         | NULL             |
| 20          | Tom           | 120.00           |